app/Http/Controllers/CartController.php

    public function save(Request $request)
    {
        $request->validate([
            'product_variation_id' => 'required'
        ]);

        $cart = \App\Models\Cart::firstOrCreate([
            'session_id' => session()->getId()
        ]);

        $cart->photoVariations()->syncWithoutDetaching($request->product_variation_id);
---
select * from `carts` where `session_id` = 'Gigp3l0jFZLCIPOQRXAcM1PF3LQWNlUC0DHfiViq' limit 1
delete from `cart_photo` where `cart_id` = 1 and `photo_variation_id` in (1)
insert into `cart_photo` (`cart_id`, `photo_variation_id`) values (1, 2)