app/Http/Controllers/HomeController.php

    public function index()
    {
        $photos = \App\Models\Photo::all();
---
select * from `photos`