app/Http/Controllers/PhotoController.php

    public function show(Request $request)
    {
        $photo = \App\Models\Photo::where('idx', $request->id)->first();
---
select * from `photos` where `idx` = 'aabbcc123' limit 1