app/Models/Cart.php

    public function totalAmount()
    {
        return $this->photoVariations->sum('price');
---
select `photo_variations`.*, `cart_photo`.`cart_id` as `pivot_cart_id`, `cart_photo`.`photo_variation_id` as `pivot_photo_variation_id` from `photo_variations` inner join `cart_photo` on `photo_variations`.`id` = `cart_photo`.`photo_variation_id` where `cart_photo`.`cart_id` = 1