app/Providers/AppServiceProvider.php

    public function boot()
    {
        View::composer('*', function($view){
            $view->with('cart', \App\Models\Cart::where('session_id', session()->getId())->first());
        });
---
select * from `carts` where `session_id` = 'Gigp3l0jFZLCIPOQRXAcM1PF3LQWNlUC0DHfiViq' limit 1